In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Get Data

In [2]:
customer_df=pd.read_csv('we_fn_use_c_marketing_customer_value_analysis.csv')

# Cleaning/Wrangling/EDA

### Definig a function to do a basic clean like the numerical data and returning only the cleaned categorical dataframe

In [3]:
def basic_clean(customer_df):
    
    pd.set_option('display.max_columns', None)
    customer_df.columns = customer_df.columns.str.lower().str.replace(' ', '_')
    customer_df.columns = customer_df.columns.str.replace('employmentstatus', 'employment_status')
    customer_df['effective_to_date'] = customer_df['effective_to_date'].astype('datetime64[ns]')
    categorical_df=customer_df.select_dtypes(include=np.object)
    return categorical_df

In [4]:
categorical_df = basic_clean(customer_df)

C:\Users\sabba\AppData\Local\Temp\ipykernel_40028\2740021108.py:7: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  categorical_df=customer_df.select_dtypes(include=np.object)

In [5]:
display(categorical_df)
display(categorical_df.shape)

,customer,state,response,coverage,education,employment_status,gender,location_code,marital_status,policy_type,policy,renew_offer_type,sales_channel,vehicle_class,vehicle_size
0,BU79786,Washington,No,Basic,Bachelor,Employed,F,Suburban,Married,Corporate Auto,Corporate L3,Offer1,Agent,Two-Door Car,Medsize
1,QZ44356,Arizona,No,Extended,Bachelor,Unemployed,F,Suburban,Single,Personal Auto,Personal L3,Offer3,Agent,Four-Door Car,Medsize
2,AI49188,Nevada,No,Premium,Bachelor,Employed,F,Suburban,Married,Personal Auto,Personal L3,Offer1,Agent,Two-Door Car,Medsize
3,WW63253,California,No,Basic,Bachelor,Unemployed,M,Suburban,Married,Corporate Auto,Corporate L2,Offer1,Call Center,SUV,Medsize
4,HB64268,Washington,No,Basic,Bachelor,Employed,M,Rural,Single,Personal Auto,Personal L1,Offer1,Agent,Four-Door Car,Medsize
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9129,LA72316,California,No,Basic,Bachelor,Employed,M,Urban,Married,Personal Auto,Personal L1,Offer2,Web,Four-Door Car,Medsize
9130,PK87824,California,Yes,Extended,College,Employed,F,Suburban,Divorced,Corporate Auto,Corporate L3,Offer1,Branch,Four-Door Car,Medsize
9131,TD14365,California,No,Extended,Bachelor,Unemployed,M,Suburban,Single,Corporate Auto,Corporate L2,Offer1,Branch,Four-Door Car,Medsize
9132,UP19263,California,No,Extended,College,Employed,M,Suburban,Married,Personal Auto,Personal L2,Offer3,Branch,Four-Door Car,Large
9133,Y167826,California,No,Extended,College,Unemployed,M,Suburban,Single,Corporate Auto,Corporate L3,Offer4,Call Center,Two-Door Car,Medsize

(9134, 15)

### Checking the info. With the result we can already see there are no null values in our dataframe

In [6]:
categorical_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9134 entries, 0 to 9133
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer           9134 non-null   object
 1   state              9134 non-null   object
 2   response           9134 non-null   object
 3   coverage           9134 non-null   object
 4   education          9134 non-null   object
 5   employment_status  9134 non-null   object
 6   gender             9134 non-null   object
 7   location_code      9134 non-null   object
 8   marital_status     9134 non-null   object
 9   policy_type        9134 non-null   object
 10  policy             9134 non-null   object
 11  renew_offer_type   9134 non-null   object
 12  sales_channel      9134 non-null   object
 13  vehicle_class      9134 non-null   object
 14  vehicle_size       9134 non-null   object
dtypes: object(15)
memory usage: 1.0+ MB

### Creating a loop to show the unique values for all the columns in one go

In [7]:
for col in categorical_df.columns:
    print(col)
    print(categorical_df[col].unique())
    print('\n')

customer
['BU79786' 'QZ44356' 'AI49188' ... 'TD14365' 'UP19263' 'Y167826']


state
['Washington' 'Arizona' 'Nevada' 'California' 'Oregon']


response
['No' 'Yes']


coverage
['Basic' 'Extended' 'Premium']


education
['Bachelor' 'College' 'Master' 'High School or Below' 'Doctor']


employment_status
['Employed' 'Unemployed' 'Medical Leave' 'Disabled' 'Retired']


gender
['F' 'M']


location_code
['Suburban' 'Rural' 'Urban']


marital_status
['Married' 'Single' 'Divorced']


policy_type
['Corporate Auto' 'Personal Auto' 'Special Auto']


policy
['Corporate L3' 'Personal L3' 'Corporate L2' 'Personal L1' 'Special L2'
 'Corporate L1' 'Personal L2' 'Special L1' 'Special L3']


renew_offer_type
['Offer1' 'Offer3' 'Offer2' 'Offer4']


sales_channel
['Agent' 'Call Center' 'Web' 'Branch']


vehicle_class
['Two-Door Car' 'Four-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car']


vehicle_size
['Medsize' 'Small' 'Large']

### Dropping the irrelevant customer column

In [8]:
categorical_df=categorical_df.drop(['customer'], axis=1)

### Creating a for loop to show the value_counts for all the columns in one go

In [26]:
#for col in categorical_df.columns:
    
    #display(categorical_df[col].value_counts().to_frame())
    #print()

#### Column education can be grouped in 2 groups: "superior education" AND "secondary or below"

In [10]:
categorical_df['education'].unique()

array(['Bachelor', 'College', 'Master', 'High School or Below', 'Doctor'],
      dtype=object)

In [11]:
def cleanEducation(x):
    x=x.lower()
    if 'bachelor' in x or 'college' in x or 'master' in x or 'doctor' in x:
        return "superior education"
    else: 
        return 'secondary or below'
    return x
categorical_df['education'] = categorical_df['education'].apply(cleanEducation)

In [12]:
categorical_df['education'].value_counts()

superior education    6512
secondary or below    2622
Name: education, dtype: int64

#### Column employment_status allows to group the minority values (3 of them) into one category: "other"

In [13]:
categorical_df['employment_status'].unique()

array(['Employed', 'Unemployed', 'Medical Leave', 'Disabled', 'Retired'],
      dtype=object)

In [14]:
def cleanEmployment(y):
    y=y.lower()
    if 'medical leave' in y or 'disabled' in y or 'retired' in y:
        return "other"
    else: 
        return y
    
categorical_df['employment_status'] = categorical_df['employment_status'].apply(cleanEmployment)

In [15]:
categorical_df['employment_status'].value_counts()

employed      5698
unemployed    2317
other         1119
Name: employment_status, dtype: int64

#### Column state allows us to classify the states into two groups: "mountain states AND "pacific states"

In [16]:
categorical_df['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon'],
      dtype=object)

In [17]:
def cleanState(w):
    w=w.lower()
    if 'california' in w or 'washington' in w or 'oregon' in w:
        return "pacific states"
    else: 
        return 'mountain states'
    return w
categorical_df['state'] = categorical_df['state'].apply(cleanState)

In [18]:
categorical_df['state'].value_counts()

pacific states     6549
mountain states    2585
Name: state, dtype: int64

#### When comparing the columns "policy" and "policy_type" it shows that policy column is the sub-categories of policy_type column. Therefore we can keep just the broader classification on this case, the "police_type" column

In [19]:
categorical_df=categorical_df.drop(['policy'], axis=1)

In [20]:
# While we are at it, let´s clean the "policy_type" categories, removing the 'auto' out of the category.
categorical_df['policy_type']=categorical_df['policy_type'].str.replace('Auto', '').str.strip()

In [21]:
categorical_df['policy_type'].unique()

array(['Corporate', 'Personal', 'Special'], dtype=object)

#### The column 'renew_offer_type' has alpha-numerica data. Let´s clean it.

In [22]:
categorical_df['renew_offer_type'].unique()

array(['Offer1', 'Offer3', 'Offer2', 'Offer4'], dtype=object)

In [23]:
categorical_df['renew_offer_type'] = categorical_df['renew_offer_type'].replace({
    'Offer1': 'A',
    'Offer2': 'B',
    'Offer3': 'C',
    'Offer4': 'D'
})

In [24]:
categorical_df['renew_offer_type'].value_counts()

A    3752
B    2926
C    1432
D    1024
Name: renew_offer_type, dtype: int64

## Final Check

In [25]:
for col in categorical_df.columns:
    
    display(categorical_df[col].value_counts().to_frame())
    print()

                 state
pacific states    6549
mountain states   2585

     response
No       7826
Yes      1308

          coverage
Basic         5568
Extended      2742
Premium        824

                    education
superior education       6512
secondary or below       2622

            employment_status
employed                 5698
unemployed               2317
other                    1119

   gender
F    4658
M    4476

          location_code
Suburban           5779
Rural              1773
Urban              1582

          marital_status
Married             5298
Single              2467
Divorced            1369

           policy_type
Personal          6788
Corporate         1968
Special            378

   renew_offer_type
A              3752
B              2926
C              1432
D              1024

             sales_channel
Agent                 3477
Branch                2567
Call Center           1765
Web                   1325

               vehicle_class
Four-Door Car           4621
Two-Door Car            1886
SUV                     1796
Sports Car               484
Luxury SUV               184
Luxury Car               163

         vehicle_size
Medsize          6424
Small            1764
Large             946